Revit 2026 API

# RibbonItemData Class

---

Base class used to contain information necessary to construct a RibbonItem in the Ribbon.

SystemObject Autodesk.Revit.UIItemData Autodesk.Revit.UIRibbonItemData More

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class RibbonItemData : ItemData
```
```vb
Public Class RibbonItemData
	Inherits ItemData
```
```cpp
public ref class RibbonItemData : public ItemData
```
```fsharp
type RibbonItemData =
    class
        inherit ItemData
    end
```

The RibbonItemData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from ItemData) |
|  | LongDescription | Long description of the command tooltip |
|  | Name | The internal name of the item. (Inherited from ItemData) |
|  | ToolTip | The tooltip of item. (Inherited from ItemData) |
|  | ToolTipImage | The image to show as a part of the button extended tooltip |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from ItemData) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetContextualHelp | Gets the contextual help bound with this control. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | SetContextualHelp | Sets the contextual help bound with this button data. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.UI Namespace

SystemObject Autodesk.Revit.UIItemData Autodesk.Revit.UIRibbonItemData Autodesk.Revit.UIButtonData Autodesk.Revit.UIComboBoxData Autodesk.Revit.UIComboBoxMemberData Autodesk.Revit.UIRadioButtonGroupData Autodesk.Revit.UITextBoxData